%%***************%%%%%%作业1.2***********&&&&%%
x0=[-1:0.01:1];           
y0=1./(1+25*x0.^2);        %%绘制f(x)图像
plot(x0,y0); 
axis([-1.1,1.1,-0.5,1.1]);
hold on;

rand_x=2*rand(1,19)-1;    %产生19个（-1,1）的随机数--作插值节点
x=[-1,rand_x,1];          %21个插值节点（附加端点）
y=1./(1+25*x.^2);
plot(x,y,'go', 'MarkerSize',8);
X=[-1:0.01:1];           %创建需要的插值点
m=length(X);
L=zeros(1,m);            %插值点拉格朗插值后的值--空向量       
for i=1:m
    L(i)=lagr_fun(x,y,X(i));   %计算出需要插值点的对应的值
end
plot(X,L,'-b','LineWidth',1);
legend('原函数图像','插值节点','随机二一点二十次插值多项式');