%%**************&&&&&&&&&&--作业1.3---*********&&&&&&--分段二次拉格朗插值*********%%
x0=[-1:0.01:1];           
y0=1./(1+25*x0.^2);        %%绘制f(x)图像
plot(x0,y0); 
axis([-1.1,1.1,-0.5,1.1]);
hold on;

%差值节点
x=[-1:0.2:1];              %分成10等份，11个插值节点
y=1./(1+25*x.^2);          %11个插值节点对应的函数值

rand_x=2*rand(1,1000)-1;   %随机创建插值点（-1,1）
y0=zeros(1,1000);          %承接计算的二次差值点值
for i=1:1000
    if(rand_x(i)<=-0.6 && rand_x(i)>=-1) 
        y0(i)=y(1)*(rand_x(i)-x(2))*(rand_x(i)-x(3))/(x(1)-x(2))/(x(1)-x(3))+...
            y(2)*(rand_x(i)-x(1))*(rand_x(i)-x(3))/(x(2)-x(1))/(x(2)-x(3))+...
             y(3)*(rand_x(i)-x(1))*(rand_x(i)-x(2))/(x(3)-x(1))/(x(3)-x(2));
    
    elseif(rand_x(i)<=-0.2 && rand_x(i)>-0.60)  
        y0(i)=y(3)*(rand_x(i)-x(4))*(rand_x(i)-x(5))/(x(3)-x(4))/(x(3)-x(5))+...
            y(4)*(rand_x(i)-x(3))*(rand_x(i)-x(5))/(x(4)-x(3))/(x(4)-x(5))+...
             y(5)*(rand_x(i)-x(3))*(rand_x(i)-x(4))/(x(5)-x(4))/(x(5)-x(3));

    elseif(rand_x(i)<=0.2 && rand_x(i)>-0.20)  
        y0(i)=y(5)*(rand_x(i)-x(6))*(rand_x(i)-x(7))/(x(5)-x(6))/(x(5)-x(7))+...
            y(6)*(rand_x(i)-x(5))*(rand_x(i)-x(7))/(x(6)-x(5))/(x(6)-x(7))+...
             y(7)*(rand_x(i)-x(5))*(rand_x(i)-x(6))/(x(7)-x(6))/(x(7)-x(5));
    
    elseif(rand_x(i)<=0.6 && rand_x(i)>0.20)  
        y0(i)=y(7)*(rand_x(i)-x(8))*(rand_x(i)-x(9))/(x(7)-x(8))/(x(7)-x(9))+...
            y(8)*(rand_x(i)-x(7))*(rand_x(i)-x(9))/(x(8)-x(7))/(x(8)-x(9))+...
             y(9)*(rand_x(i)-x(7))*(rand_x(i)-x(8))/(x(9)-x(8))/(x(9)-x(7));
   
    else
        y0(i)=y(9)*(rand_x(i)-x(10))*(rand_x(i)-x(11))/(x(9)-x(10))/(x(9)-x(11))+...
            y(10)*(rand_x(i)-x(9))*(rand_x(i)-x(11))/(x(10)-x(9))/(x(10)-x(11))+...
             y(11)*(rand_x(i)-x(9))*(rand_x(i)-x(10))/(x(11)-x(10))/(x(11)-x(9));
    end
end
scatter(rand_x,y0);
legend('原函数图像','分段二次插值散点');