%%***********########作业1.1.1############%%
x0=[-1:0.01:1];           
y0=1./(1+25*x0.^2);        %%绘制f(x)图像
plot(x0,y0); 
axis([-1.1,1.1,-0.5,1.1]);
hold on;

x=[-1:0.2:1];            %[-1 1]均等分为10份，11个点设为已知插值节点
y=1./(1+25*x.^2);        %11个已知插值节点对应的函数值
plot(x,y,'go', 'MarkerSize',8)           %在绘图窗口标出原数据点
X=[-1:0.01:1];           %创建要插值点的
m=length(X);
L=zeros(1,m);            %插值点拉格朗插值后的值--空向量
for i=1:m
    L(i)=lagr_fun(x,y,X(i));   %计算出需要插值点的对应的值
end
plot(X,L);
legend('原函数图像','插值节点','十一点十次插值多项式');


%%**************&&&&&&&&作业1.1.2************&&&&&%%
figure
x=[-1:0.1:1];            %[-1 1]均等分为20份，21个点设为已知的插值节点
y=1./(1+25*x.^2);        %21个已知插值节点对应的函数值
plot(x,y,'go', 'MarkerSize',8)           %在绘图窗口标出原数据点

X=[-1:0.01:1];           %创建需要的插值点
m=length(X);
L=zeros(1,m);            %插值点拉格朗插值后的值--空向量       
for i=1:m
    L(i)=lagr_fun(x,y,X(i));   %计算出需要插值点的对应的值
end
plot(X,L,'-b','LineWidth',1);
legend('原函数图像','插值节点','二一点二十次插值多项式');











    

        
        




