%%利用抛物线对数据进行最小二乘法拟合
%%绘制原始数据散点图
x=[88.9 108.5 104.1 139.7 127 94 116.8 99.1];
y=[14.6 16.7 15.3 23.2 19.5 16.1 18.1 16.6];
scatter(x,y,60,'red','filled');
hold on;
xlabel('\fontsize{15}降水量(cm)');
ylabel('\fontsize{15}流速(m^2/s)');

%构造抛物线的方程  yy=a1+a2*x+a3*x^3;
m=length(x);
A=zeros(m,3);    %3--三个未知数
A(:,1)=ones(m,1);  %构造发方程矩阵

for i=2:3
    A(:,i)=(x').^(i-1);  %构造发方程矩阵
end
B=(A')*A;
Y=A'*(y');
a=B\Y;

xx=80:0.05:150;
yy=a(1)+a(2).*xx+a(3)*xx.^2;   %y=33.6534885798652-0.435901193569643×x+0.00257613424493725×x^2
plot(xx,yy,'-b','LineWidth',2);
legend('\fontsize{15}原始数据','\fontsize{15}抛物线拟合');